In [1]:
import pandas as pd
import numpy as np
# import data
df = pd.read_csv('raw_data.csv')
new_data = df.copy()

In [2]:
# Feature Engineering

# apply() : Applies a function to each element, row or column of a series or DataFrame
new_data["tax"] = new_data["income"].apply(lambda x : "20%" if x>= 60000 else "10%")
new_data

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  10%
1    1      John Doe  29.0     USA     Male  55000.0  10%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  10%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  10%

In [3]:
# Feature Engineering

# map() : Applies a function or mapping element-wise on a Series only
gender_map = { "Male" : "M", "Female" : "F", "Unknown" : "U" }
new_data["gender"] = new_data["gender"].map(gender_map)
new_data.loc[0:5, ["name", "age", "gender"]]

           name   age gender
0      John Doe  29.0      M
1      John Doe  29.0      M
2    Jane Smith   NaN      F
3          Alex   NaN      U
4  Maria Garcia  34.0      F
5        Li Wei  27.0      M

In [4]:
# Feature Engineering

# assign() : Creates or modifies columns in a DataFrame and returns a new DataFrame

# Add new column
new_data = new_data.assign(new_income = new_data["income"]*1.1)
new_data.loc[0:5]

   id          name   age country gender   income  tax  new_income
0   1      John Doe  29.0     USA      M  55000.0  10%     60500.0
1   1      John Doe  29.0     USA      M  55000.0  10%     60500.0
2   2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3   3          Alex   NaN     USA      U  47000.0  10%     51700.0
4   4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5   5        Li Wei  27.0   China      M  51000.0  10%     56100.0

In [5]:
# Feature Engineering

# replace() : Used to replace specific values in a Series or DataFrame
# Can replace using values, lists, or dictionaries

new_data["name"] = new_data["name"].replace(np.nan, "Not Available")
new_data.loc[5:7, "name"]

# Replace values across entire DataFrame
# new_data.replace(np.nan, "Not Available")

5           Li Wei
6    Not Available
7       Ahmed Khan
Name: name, dtype: object